# Fonts
cask "font-fira-code-nerd-font"

# Shell
brew "zsh"
brew "fnm"
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# CLI Tools
brew "agent-browser"
brew "bat"
brew "modem-dev/tap/hunk"
brew "xcodes"
brew "playwright-cli"
brew "duckdb"
brew "git-delta"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "glow"
brew "jj"
brew "jq"
brew "k9s"
brew "lazyjj"
brew "procs"
brew "ripgrep"
brew "tokei"
brew "tree-sitter-cli"
brew "xan"
brew "yazi"
brew "zellij"
brew "zoxide"

# AI / Context
brew "yvgude/lean-ctx/lean-ctx"

# Editors
brew "neovim"
cask "visual-studio-code"

# Apps
cask "cmux"
cask "ghostty"
cask "keepingyouawake"
cask "superwhisper"
cask "orbstack"
