# Specify an installation directory.
cask_args appdir: '/Applications'

# Install packages
tap 'homebrew/cask' || true
brew 'git'
brew 'git-extras' # https://devhints.io/git-extras
brew 'bash-completion'

# Languages
brew 'java'
brew 'rustup'
brew 'gcovr' # Generates reports from gcov test coverage.
brew 'ruby'
brew 'python'
brew 'pipenv' # Node-style local modules for Python
brew 'go'
cask 'flutter' # Includes the Dart SDK
brew 'fnm' # Node.js version manager

# Applications
cask 'visual-studio-code' # https://code.visualstudio.com/
brew 'neovim' # https://neovim.io/
cask 'docker' # https://www.docker.com/products/docker-desktop/
cask 'discord' # https://discord.com/
cask '1password' # https://1password.com/
cask 'the-unarchiver' # https://theunarchiver.com/
cask 'alacritty' # https://github.com/alacritty/alacritty
cask 'rectangle' # https://rectangleapp.com/

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-fira-code'

# Scripts
brew 'exa' # Modern replacement for ls; https://the.exa.website/
brew 'fd' # Modern replacement for find; https://github.com/sharkdp/fd
brew 'bat' # Modern replacement for cat; https://github.com/sharkdp/bat
brew 'ripgrep' # Modern replacement for grep; https://github.com/BurntSushi/ripgrep
brew 'gh' # GitHub CLI tooling; https://github.com/cli/cli
cask 'cmake' # https://cmake.org/
brew 'tmux' # Terminal multiplexer; https://github.com/tmux/tmux/wiki
brew 'reattach-to-user-namespace' # https://tekkie.dev/macos/howto/macos-pasteboard-fix-vim-tmux
brew 'tldr' # Summarize man pages, i.e. "tldr curl"
brew 'trash' # Works like rm, but restorable from the MacOS trash app
brew 'wget' # https://www.gnu.org/software/wget/
brew 'zoxide' # Smarter "cd"; https://github.com/rupa/z
brew 'fzf' # Fuzzy finder; https://github.com/junegunn/fzf#using-homebrew
brew 'zsh' # https://www.zsh.org/
brew 'zsh-completions' # https://github.com/zsh-users/zsh-completions
